# -*- coding: utf-8 -*-

# Author: june-fu
# Date  : 2020/1/30
"""
企业发放的奖金根据利润提成。
利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，
高于100万元时，超过100万元的部分按1%提成，从键盘输入当月利润I，求应发放奖金总数？
"""


# 直来直去的写
def profile(p):
    a = p
    total = 0
    if a > 1000000:
        total += (a - 1000000) * 0.01
        a = 1000000
    if a > 600000:
        total += (a - 600000) * 0.015
        a = 600000
    if a > 400000:
        total += (a - 400000) * 0.03
        a = 400000
    if a > 200000:
        total += (a - 200000) * 0.05
        a = 200000
    if a > 100000:
        total += (a - 100000) * 0.075
        a = 100000
    if a <= 100000:
        total += a * 0.1

    return total


# 数轴来分界，定位问题；将分界存入list，通过遍历list获得结果
def profile2(p):
    arr = [1000000, 600000, 400000, 200000, 100000, 0]
    rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
    a = p
    total = 0
    for i in range(6):
        if a > arr[i]:
            total += (a - arr[i]) * rat[i]
            a = arr[i]
    return total


if __name__ == '__main__':
    x = int(input("净利润:"))
    print(profile(x))
    print(profile2(x))


